Revit 2027 API
FabricationPart.GetVersionHistory Method
 Gets a history of version change information about the current part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationVersionInfo> GetVersionHistory()
Public Function GetVersionHistory As IList(Of FabricationVersionInfo)
public:
IList<FabricationVersionInfo^>^ GetVersionHistory()
member GetVersionHistory : unit -> IList<FabricationVersionInfo>
Return Value
IList<FabricationVersionInfo>
 A list of version information about the current part. The list starts with the most recent changes.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace